In [1]:
import pandas as  pd
import numpy as np

In [7]:
dict = {'Col1': [1, 2, 3, np.nan],
        'Col2': [4, np.nan, 6, 7],
'Col3': ['a','b','c', None]}

In [23]:
df = pd.DataFrame(dict)

In [12]:
df

   Col1  Col2  Col3
0   1.0   4.0     a
1   2.0   NaN     b
2   3.0   6.0     c
3   NaN   7.0  None

In [14]:
df.isnull()

    Col1   Col2   Col3
0  False  False  False
1  False   True  False
2  False  False  False
3   True  False   True

ahora de manera numerica y si es true habra un numero 1

In [15]:
df.isnull()*1

   Col1  Col2  Col3
0     0     0     0
1     0     1     0
2     0     0     0
3     1     0     1

ahora llenamos los  valores nulos con lo que querramos en este caso mi nombre

In [16]:
df.fillna('Pedro')

    Col1   Col2   Col3
0    1.0    4.0      a
1    2.0  Pedro      b
2    3.0    6.0      c
3  Pedro    7.0  Pedro

y ahora los llenamos estos valores nulo con la media  y en teoria tendria que aparecer en los valores nulos la media obtenida de los otros valores de la columna y si hay letras sera NONE.
hay un error

In [34]:
df.fillna(df.mean())

El error que estás viendo es causado porque estás intentando calcular la media (mean()) de tu DataFrame, pero parece que una o más columnas de tu DataFrame son de tipo string (str). La función mean() no puede calcular la media de los datos de tipo string.

Para solucionar este problema, podrías intentar aplicar la función mean() solo a las columnas que contienen datos numéricos. Aquí te dejo un ejemplo de cómo podrías hacerlo:
Este código recorre todas las columnas en tu DataFrame y aplica la función mean() solo a las columnas que contienen datos numéricos (int64 o float64).

In [ ]:
for col in df.columns:
    if df[col].dtype in ['int64', 'float64']:
        df[col].fillna(df[col].mean(), inplace=True)

In [35]:
df

   Col1      Col2  Col3
0   1.0  4.000000     a
1   2.0  5.666667     b
2   3.0  6.000000     c
3   2.0  7.000000  None

ahora si queremos que llene los valores como si estubiera en serie 1,2,3 usamos el funcion interpolate , pero no  se pasa el maximo por ejemplo el 3.0 3.0 .

In [30]:
df.interpolate()

   Col1  Col2  Col3
0   1.0   4.0     a
1   2.0   5.0     b
2   3.0   6.0     c
3   3.0   7.0  None

o borramos los valores nulos

In [31]:
df.dropna()

   Col1  Col2 Col3
0   1.0   4.0    a
2   3.0   6.0    c